Revit 2024 API
ParameterTypeId.FabricSheetMajorDirectionWireType Property
 "Major Direction Wire Type": Major Direction Wire Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricSheetMajorDirectionWireType { get; }
Visual Basic
Public Shared ReadOnly Property FabricSheetMajorDirectionWireType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricSheetMajorDirectionWireType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace